haliwt/PIC1828_PCBV07_Reposit/nHIOS_PIC16F1828_Machine_pcv08.X/newmain.c
                  IOCIE =0;
                  IOCIF=1;
                  PEIE =0;   
                  GIE = 0;
                  IOCAP2 = 0;  //Flag IOCAF0  //WT.EDIT 2019-02-20
                  IOCAN2 =0; 
                
                  rem=1;
				  
                flag_brake=3;
                
		        k=0;
				
			    flag_run=0;
		        my_drv.error_f=0;
			    my_drv.default_f =0;
                my_drv.drv_enable = 0;
			     my_drv.drv_brake=0;
                my_drv.drv_dir=0;
                 flag_power_on=0;
                Auto_OutPut_Brake=0;

			    }
				
					break;
			}
			
		  
            
	      }
	}
	/*************************************************************************************
	**************************************************************************************
	**************************************************************************************/
	else
	{
     
	  if((flag_power_on==2)||(my_drv.drv_brake ==1))
      {

        TMR1_Counter_Enable = 0;
		flag_brake=2;
		CCPR1L =0;   //WT.EDIT 2019-06-10
        DRV_BRAKE =0 ;
        Auto_OutPut_Brake=1;
        
       // Auto_Works_Signal = 1;
        TXREG=0x00;
       }//end if(flag_power_on))
     
	  switch(mykey)
        {
            case 0 : //run works
            {
                if((mydir == 0)&&(flag_brake ==2)&&(flag_brake!=3)&&(flag_brake!=0))
                {
                    
                   // Auto_Works_Signal = 1;
                    CCPR1L =0;   //WT.EDIT 2019-06-10
                    TRISCbits.TRISC5 =1;
                     DRV_BRAKE = 0; //run
                     DRV_ENABLE=0;
				     Auto_OutPut_Brake=1;
                     delay_10ms(2); //WT.EDIT 20190505
                     k=0;
                    // Auto_Works_Signal = 1;
                     TXREG=0x55;
                   
                     //delay_1ms(10);
                     
                }
				/***********************CW*****************************/
				else if(((((mydir == 1)||(my_drv.drv_dir==1))&&flag_brake != 2) ||((mydir==0)&&(flag_brake == 4)))
                               &&(my_drv.drv_enable!=1 && flag_brake !=5 && flag_brake !=2))
               {
                    DRV_DIR =0;//WT.EDIT 2019-06-13
                    Auto_OutPut_Brake=0;
                    DRV_BRAKE = 1; //run
                    DRV_ENABLE=1;
                    TRISCbits.TRISC5 =0;
                    TMR1_Counter_Enable = 1;
                    rem++;
                    if(rem==2)
                    {
                     
                        DRV_DIR =0; //WT.EDIT 2019-06-13
                        rem++;
                        
                       
                         CCPR1L =0x0;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x01;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x02;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x03;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x04;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x05;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x06;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x07;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x08;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x09;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x0a;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L =0x0b;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L = 0x0c;    //MSB 8bit<>pulse duty of value
                         DRV_DIR =0;
                         CCPR1L = 0x0d;    //MSB 8bit<>pulse duty of value
                        
                         TXREG=0xa1;
                        // my_drv.error_f = 1;
                    }
                    
#if 1
                     /*judge overcurrent value*/
                    if(PIR1bits.TMR1IF == 1) 
                    {
#if 1
                       TXREG= 0xff ;
                       //delay_1ms(5);
                       TXREG= 0xaa ;
                       //delay_1ms(5);
                       TMR1_Counter_Enable = 0;
                       PIR1bits.TMR1IF =0;
                       TMR1L =0;
                       TMR1H =0;
#endif 
                       adc_value = ADC_GetValue();
#if 1
                       if(adc_value > 32 || adc_value ==32)
                       {
                             my_drv.error_f ++;
                             flag_run ++;
                             TXREG = my_drv.error_f;
                            if( my_drv.error_f ==2 ||flag_run == 2)
                            {
                                flag_brake=2;
                                my_drv.default_f= 1;
                                flag_run=0;
                                TXREG = 0xab;
                                CCPR1L = 0; //WT.EDIT 2019-06-10
                                Auto_OutPut_Brake=0;
                                //Auto_Works_Signal = 0;
                                DRV_BRAKE =0;
                                TRISCbits.TRISC5 =1;
                                delay_10ms(6);  //WT.EDIT 20190505
                                DRV_BRAKE =0;
                                DRV_ENABLE=0;
                                convertDecimalToHexa(adc_value);
                                my_drv.error_f=0;
                                __delay_ms(2);
                               
                                while(1);
                                
                                
