haliwt/PIC1828_PCBV07_Reposit/nHIOS_PIC16F1828_Machine_pcv08.X/newmain.c
                            }
                       }
                       else
#endif              
                       convertDecimalToHexa(adc_value);
                      
                    }
#endif 
                    rem=5;
                    
                    
                   // Auto_Works_Signal = 1;
                    Auto_OutPut_Brake=0;
                  
                      IOCIE =1;
                      IOCIF=0;
                      PEIE =1;   
                      GIE = 1; 
                      IOCAP2 = 1;  //Flag IOCAF0  //WT.EDIT 2019-02-20
                      IOCAN2 =1; 
                   
                 
                     
                     
                     flag_brake =4;
                     my_drv.drv_dir=4; //WT.EDIT 20190508
                  
                     flag_power_on=1;
                     my_drv.drv_enable=2;
                    
                      
                }  
				
				/**********************ccw*******************************************************/
				  else if(((mydir == 0 || my_drv.drv_dir ==2)
                         ||((mydir==1)&&(flag_brake == 5)))&&(my_drv.drv_enable!=2 && flag_brake !=4 && flag_brake !=2))
					{
					    
		                    DRV_DIR =1;
		                    /**/
		                    //Auto_Works_Signal = 0;
		                    Auto_OutPut_Brake=0;
		                  
		                    DRV_BRAKE = 1; //run
		                    DRV_ENABLE=1;
		                    TRISCbits.TRISC5 =0;
							TMR1_Counter_Enable = 1;
		                    rem++;
		                    if(rem==2)
		                    {
		                        DRV_DIR =1; 
		                       
		                       // Auto_OutPut_Brake=0;
		                       rem++;
		                        
		                        CCPR1L =0x0;    //MSB 8bit<>pulse duty of value
		                       
		                         DRV_DIR =1; 
		                         CCPR1L =0x1;    //MSB 8bit<>pulse duty of value
		                       
		                         DRV_DIR =1; 
		                         CCPR1L =0x2;    //MSB 8bit<>pulse duty of value
		                     
		                         DRV_DIR =1; 
		                         CCPR1L =0x3;    //MSB 8bit<>pulse duty of value
		                      
		                         DRV_DIR =1; 
		                         CCPR1L =0x4;    //MSB 8bit<>pulse duty of value
		                      
		                         DRV_DIR =1; 
		                         CCPR1L =0x5;    //MSB 8bit<>pulse duty of value
		                       
		                         DRV_DIR =1;    
		                        CCPR1L =0x06;    //MSB 8bit<>pulse duty of value
		                        
		                         DRV_DIR =1;    
		                         CCPR1L =0x07;    //MSB 8bit<>pulse duty of value
		                           
		                         DRV_DIR =1;   
		                         CCPR1L = 0x08;    //MSB 8bit<>pulse duty of value
		                        
		                         DRV_DIR =1;    
		                         CCPR1L = 0x09;    //MSB 8bit<>pulse duty of value
		                         
		                         DRV_DIR =1;    
		                         CCPR1L = 0x0a;    //MSB 8bit<>pulse duty of value
		                       
		                          DRV_DIR =1;    
		                          CCPR1L = 0x0b;    //MSB 8bit<>pulse duty of value
		                          
		                          DRV_DIR =1;    
		                          CCPR1L = 0x0c;    //MSB 8bit<>pulse duty of value
		                          
		                           DRV_DIR =1;    
		                          CCPR1L = 0x0d;    //MSB 8bit<>pulse duty of value
		                       
		                          
		                          //TXREG=0xb1;
		                         
		                    }
		                    DRV_DIR =1;
		                  
		                    
		                    GIE =0;
                           
#if 1				    
		                     if(PIR1bits.TMR1IF == 1) 
		                    {
#if 1
		                       TXREG= 0xee ;
		                       //delay_1ms(5);
		                       TXREG= 0xbb ;
		                       //delay_1ms(5);
		                       TMR1_Counter_Enable = 0;
		                       PIR1bits.TMR1IF =0;
		                       TMR1L =0;
		                       TMR1H =0;
#endif 
		                       adc_value = ADC_GetValue();
#if 1
		                       if(adc_value > 32 || adc_value ==32)
		                       {
		                             my_drv.error_f ++;
		                             flag_run ++;
		                             TXREG = my_drv.error_f;
		                            if( my_drv.error_f ==2 || flag_run == 2)
		                            {
		                                flag_brake=2;
		                                my_drv.default_f= 1;
		                               
		                                TXREG = 0xba;
		                                CCPR1L = 0; //WT.EDIT 2019-06-10
		                                Auto_OutPut_Brake=0;
		                               // Auto_Works_Signal = 0;
		                                DRV_BRAKE =0;
		                                TRISCbits.TRISC5 =1;
		                                delay_10ms(6);  //WT.EDIT 20190505
		                                DRV_BRAKE =0;
		                                DRV_ENABLE=0;
		                                convertDecimalToHexa(adc_value);
		                                my_drv.error_f=0;
                                        flag_run=0;
		                                __delay_ms(2);
		                                
		                                while(1);
		                                
		                                
		                            }
		                       }
		                       else
#endif              
		                       convertDecimalToHexa(adc_value);
		                      
