haliwt/PIC1828_PCBV07_Reposit/nHIOS_PIC16F1828_Machine_pcv08.X/newmain.c
		                    }
#endif 
		                    rem=5;
		                    // TXREG=0x22;
		                  
		                     flag_brake=5;
		                  
		                     flag_power_on=0; //WT.EIDT 20190508
		                     my_drv.drv_dir=3;
							 my_drv.drv_brake =3; //WT.EDIT 20190508
						     Auto_OutPut_Brake=0;
		                    // Auto_Works_Signal = 0;
		                
		                   // TXREG=0x33;
		              
		                    my_drv.drv_enable=1;
		                  //   mydir = Manual_Operation_Dir();
		                  //  mykey =GetKeyPad();
		                  
		                 
					
		            }
		         
		            break;
            	}
			case 1: //STOP_key
            {

                  CCPR1L = 0; //WT.EDIT 2019-06-10
                  Auto_OutPut_Brake=0;
                  //Auto_Works_Signal = 0;
                  DRV_BRAKE =0;
                  TRISCbits.TRISC5 =1;
                  delay_10ms(6);  //WT.EDIT 20190505
                  DRV_BRAKE =0;
                  DRV_ENABLE=0;
                 
                  IOCIE =0;
                  IOCIF=1;
                  PEIE =0;   
                  GIE = 0;
                  IOCAP2 = 0;  //Flag IOCAF0  //WT.EDIT 2019-02-20
                  IOCAN2 =0; 
                
                  rem=1;
				  
                flag_brake=3;
                
		        k=0;
				
			    flag_run=0;
		        my_drv.error_f=0;
			    my_drv.default_f =0;
                my_drv.drv_enable = 0;
			     my_drv.drv_brake=0;
                my_drv.drv_dir=0;
                 flag_power_on=0;
                Auto_OutPut_Brake=0;
             
			
			   
                 
		    }
            break;
       
            
           
           

	     default :
	     	{
			  TRISCbits.TRISC5 =1;
			  DRV_ENABLE=0;
			  flag_power_on=0;
			  Auto_OutPut_Brake=0;
			 
			 // Auto_Works_Signal = 0;
			  k=0;
			
      
			 
			}
            break;
         }//end switch(mykey)
    
     

     }//end while(1)
	 
     }
   }

/**************************************************************
 *
 * Function function: interrupt program hall sensor
 * Input Reference :Noting
 * Return Reference :Noting
 *  Note:MPLAB X is 3.0 :void interrupt Hallsensor(void)
 *
******************************************************/

void __interrupt() Hallsensor(void)
{
   
if((INTF == 1) ||(IOCAF2 == 1) || (IOCAP2 ==1)||(PORTAbits.RA2 == 0)||(IOCIF ==1))
{
     
      INTF =0;
	  IOCIF =0;
      IOCAF2=0;
      IOCAP2=0;
      flag_power_on=flag_power_on+ 1;
      my_drv.drv_brake =1;
      TXREG=0x66;
      delay_100us(5);
     
      CCPR1L =0;   //WT.EDIT 2019-06-10
      TRISCbits.TRISC5 =1;
      DRV_BRAKE =0 ;
      Auto_OutPut_Brake=1;
      delay_10ms(5);
      TXREG=0x66;
      //delay_1ms(2);
 
 }

  
}  


   
 




